1s/ERP/Conf/Enums/Лико_ТипыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОпределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамоклеящаясяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВплавляемаяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Термоусадка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полуфабрикат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолуфабрикатПодАппликатор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйПовтор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторСНовымОбъединением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторСИзменением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СложныйПовтор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйПовторСПереводомНаДругуюМашину</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйповторСПеревыводом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦифроваяПроба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оснастка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Security</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Техобслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестированиеМатериалов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеределЗаказаПричинаРекламация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеределЗаказаПереборкаПереупаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутренниеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйССохранениемФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шаблон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыЭтикеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыЭтикеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КЭ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кльр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пакет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ВидыСекций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ВидыСекций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Намотка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размотка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Многострочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыРедактированияПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтоброжатьИерархиюПриВыборе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВТЧЦвета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВТЧРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТМЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВидТМЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тиснение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ламинация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткоеДизнайнеров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оснастка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Печать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыСекций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПараметрСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ПараметрыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНаФорме</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидНаФорме</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ПараметрыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЗаливки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыТМЦ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаливки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидЗаливки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Раппорты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Раппорты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Макс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дюймы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение1_8</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение1_16</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение1_48</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Z</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ZКоличествоЗубьев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_КоэффициентыДляРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_КоэффициентыДляРасчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецКраска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВСмеси</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыЦвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦвета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипыЦвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидМатериала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/CommonModules/Лико_ТиражМетраж/Ext/Module.bsl
//Определение Тиража и Метража
#Область ТиражМетраж

Функция ПолучитьВидВырубки(ЗаказСсылка, СпецификацияСсылка = Неопределено) Экспорт 		// --> Начало Лико Митюшин МФМ 18.03.2021
	
	// --> Начало Лико Субботин 18.07.2022
	//Если  ТипЗнч(ЗаказСсылка) = тип("ДокументСсылка.ЗаказКлиента") Тогда 
	//	Если ЗаказСсылка.ИспользоватьСекции  Тогда
	//		Возврат ПолучитьВидВырубкиСекции(ЗаказСсылка, СпецификацияСсылка);	
	//	КонецЕсли; 
	//КонецЕсли;	
	// <-- Конец Лико Субботин 23.05.2022  
	
	Если ЗаказСсылка.КнижныйМодуль И ?(СпецификацияСсылка = Неопределено, Не ЗаказСсылка.Цифровой, Истина) Тогда 
		Возврат 13;
	КонецЕсли;
	
	//Предопределенные значения справочников, чтобы не получать несколько раз
	текВидПечать 	= Справочники.ВидыРаботСотрудников.Печать;
	ВидРЦSchober 	= Справочники.ВидыРабочихЦентров.Schober;
	ВидРЦIndigo 	= Справочники.ВидыРабочихЦентров.Indigo;
	ВидРЦCartes 	= Справочники.ВидыРабочихЦентров.Cartes;
	ВидРЦOmega	 	= Справочники.ВидыРабочихЦентров.Omega;
	ВидРЦNewFoil	= Справочники.ВидыРабочихЦентров.NewFoil;
	ВидРЦGallusInkjet	= Справочники.ВидыРабочихЦентров.GallusInkjet;
	ВидРЦOmet       = Справочники.ВидыРабочихЦентров.Omet;
	ВидРЦWeigang       = Справочники.ВидыРабочихЦентров.Weigang;
	//Добавлен дополнительтельно Татани 
	ВидРЦTatani		= Справочники.ВидыРабочихЦентров.Tatani;
	ВидРЦComexi		= Справочники.ВидыРабочихЦентров.Comexi;
	//Если Спецификация передаём строку Таблицы ПараметрыШтампа, Заказ - Заказ 
	Заказ = ЗаказСсылка;
	
	текПараметрыОтбора = Новый Структура;
	текПараметрыОтбора.Вставить("ВидРабот", Справочники.ВидыРаботСотрудников.Вырубка);
	ШтампЗаполнен = ЗначениеЗаполнено(Заказ.ШтампВырубной);
	Если ШтампЗаполнен Тогда 
		текПараметрыОтбора.Вставить("Оснастка", Заказ.ШтампВырубной);
	КонецЕсли;
	//Если Спецификация то меняем Строку Таблицы, на Спецификацию.
	// <-- Конец Лико Яцун С. В. 12.09.2024 
	//Спецификация рассчитывается как заказ
	//Если СпецификацияСсылка <> Неопределено Тогда 
	//	НомерВарианта = ЗаказСсылка.НомерВарианта;
	//	Заказ = СпецификацияСсылка;
	//	Если Не ШтампЗаполнен Тогда
	//		ПараметрыОтбора = Новый Структура;
	//		ПараметрыОтбора.Вставить("НомерСтроки", НомерВарианта);
	//		МассивВариантСпецификации = Заказ.ВариантыСпецификации.НайтиСтроки(ПараметрыОтбора);
	//		текЦифровой = ?(МассивВариантСпецификации.Количество() > 0, МассивВариантСпецификации[0].Цифровой, Ложь); 
	//	КонецЕсли;
	//Иначе
	// <-- Начало Лико Яцун С. В. 12.09.2024
		//Для Заказа
		НомерВарианта = 1;
		текЦифровой = Заказ.Цифровой;
	//КонецЕсли;
	
	// <-- Начало Лико Яцун С. В. 09.06.2023 
	//Выды вырубки отменили. Расчет параметров по правилам, которые заложены для этих видов вырубки только в том случае, если штамп не указан, включен режим редактирования (вид вырубки = 0), это будут "предварительные данные"
	//текНайденныеСтрокиНумератор = Заказ.ВидыРабот.НайтиСтроки(Новый Структура("ВидРабот,НомерВарианта",Справочники.ВидыРаботСотрудников.Нумератор,НомерВарианта));
	//Для Каждого ТекСтрока Из текНайденныеСтрокиНумератор Цикл
	//	Если ТекСтрока.РабочийЦентр.ВидРабочегоЦентра = ВидРЦOmega Тогда
	//		ТЗВидовРЦЗаказа = Новый ТаблицаЗначений;
	//		ТЗВидовРЦЗаказа.Колонки.Добавить("РабочийЦентр");
	//		Для Каждого РЦ Из Заказ.ВидыРабот Цикл
	//			Если РЦ.РабочийЦентр.ВидРабочегоЦентра = ВидРЦIndigo Тогда
	//				//Индиго + Омега с нумератором
	//				Возврат 16;
	//			КонецЕсли;
	//			НСВид = ТЗВидовРЦЗаказа.Добавить();
	//			НСВид.РабочийЦентр = РЦ.РабочийЦентр.ВидРабочегоЦентра;	
	//		КонецЦикла;
	//		ТЗВидовРЦЗаказа.Свернуть("РабочийЦентр");
	//		Если ТЗВидовРЦЗаказа.Количество() = 1 Тогда 
	//			//Только Омега с нумератором
	//			Возврат 17;   
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	// <-- Конец Лико Яцун С. В. 09.06.2023
	
	текПараметрыОтбора.Вставить("НомерВарианта", НомерВарианта);
	
	текНайденныеСтроки = Заказ.ВидыРабот.НайтиСтроки(текПараметрыОтбора);
	
	// <-- Начало Лико Яцун С. В. 05.07.2023 
	//Печать без вырубки не ТУ Омет
	Если Заказ.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.Термоусадка И текНайденныеСтроки.Количество() = 0 Тогда
		Для Каждого РЦ Из Заказ.ВидыРабот Цикл
			Если РЦ.РабочийЦентр.ВидРабочегоЦентра = ВидРЦOmet Тогда
				Возврат 18;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 05.07.2023
	// <-- Начало Лико Яцун С. В. 17.08.2023 
	//Печать без вырубки ТУ Омет
	Если Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка И текНайденныеСтроки.Количество() = 0 Тогда
		Для Каждого РЦ Из Заказ.ВидыРабот Цикл
			Если РЦ.РабочийЦентр.ВидРабочегоЦентра = ВидРЦOmet Тогда
				Возврат 19;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 17.08.2023 
	
	
	Если текНайденныеСтроки.Количество() = 0 Тогда
		//Вид вырубки - Печати без вырубки (круговые эт. и ТУ)
		Если Не ШтампЗаполнен Тогда 
			Если текЦифровой ИЛИ ЭтоПечатьНаИндиго(Заказ)Тогда 
				Возврат 6;
			Иначе
				Возврат 5;
			КонецЕсли;
		КонецЕсли;
	Иначе
		//Массив РЦ для проверки
		МассивРЦ = Новый Массив;
		МассивРЦ.Добавить(ВидРЦCartes);
		МассивРЦ.Добавить(ВидРЦOmega);
		МассивРЦ.Добавить(ВидРЦNewFoil);
		МассивРЦ.Добавить(ВидРЦGallusInkjet);
		МассивРЦ.Добавить(ВидРЦTatani);
		МассивРЦ.Добавить(ВидРЦWeigang);
		
		текВидРЦ = Неопределено;
		
		//Вид работ вырубка присутствиует, далее проверяем различные Виды вырубки.
		Для каждого ТекСтрока из текНайденныеСтроки Цикл
			текВидРЦ = ТекСтрока.РабочийЦентр.ВидРабочегоЦентра;
			//Вид вырубки - Вырубка Шобер
			Если текВидРЦ = ВидРЦSchober Тогда
				Если ЭтоПечатьНаИндиго(Заказ) Тогда
					Возврат 10;
				Иначе
					Возврат 4;
				КонецЕсли;
			КонецЕсли;

			//Вид вырубки - Вырубка Картес, Омега	
			//Иначе		
				текНайденныеСтрокиПечать = ПолучитьСтрокиПечати(текВидПечать, Заказ, НомерВарианта);
				//Добавлены Виды вырубки 14 и 15 для Tatani 
				Если текВидРЦ = ВидРЦTatani Тогда
					Если текНайденныеСтрокиПечать.Количество() = 0 Тогда
						Возврат 15;
					Иначе 
						Для Каждого ТекСтрПачатиТотами из текНайденныеСтрокиПечать Цикл
							//Если Вырубка Tatani и печать Comexi   
							Если ТекСтрПачатиТотами.РабочийЦентр.ВидРабочегоЦентра = ВидРЦComexi Тогда
								Возврат 14;	
							КонецЕсли;
						КонецЦикла;
						Возврат 15;
					КонецЕсли;
				КонецЕсли;
				
				Если текНайденныеСтрокиПечать.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				текЕстьИндиго = Ложь;
				Для Каждого текСтрокаПечати из текНайденныеСтрокиПечать Цикл
					Если ВидРЦIndigo = текСтрокаПечати.РабочийЦентр.ВидРабочегоЦентра Тогда
						текЕстьИндиго = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого текСтрокаПечати из текНайденныеСтрокиПечать Цикл
					текВидРЦПечати = текСтрокаПечати.РабочийЦентр.ВидРабочегоЦентра;
					ВМассивеРЦ = (МассивРЦ.Найти(текВидРЦ) <> Неопределено);
					Если ВМассивеРЦ И текВидРЦПечати <> ВидРЦIndigo И Не текЕстьИндиго Тогда 
						Если (текВидРЦПечати = текВидРЦ ИЛИ текНайденныеСтрокиПечать.Количество() = 1) И текВидРЦ = ВидРЦGallusInkjet Тогда
							Возврат 7;	
						ИначеЕсли (МассивРЦ.Найти(текВидРЦПечати) <> Неопределено) И (текВидРЦПечати <> ВидРЦGallusInkjet И текВидРЦПечати <> ВидРЦIndigo) Тогда
							Возврат 8;
							//Вид вырубки - Печать Индиго + вырубка Картес, Омега
						ИначеЕсли текВидРЦПечати = ВидРЦGallusInkjet И текВидРЦ <> ВидРЦGallusInkjet Тогда
							Возврат 11;
						ИначеЕсли МассивРЦ.Найти(текВидРЦПечати) = Неопределено Тогда
							Возврат 3;	
						КонецЕсли;
						//Вид вырубки - Печать Индиго + вырубка Картес, Омега
					ИначеЕсли текВидРЦПечати = ВидРЦIndigo Тогда
						Если текНайденныеСтрокиПечать.Количество() > 1 Тогда 
							Для каждого СтркаПодПоискаПечати из текНайденныеСтрокиПечать Цикл
								текПодВидРЦПечати = СтркаПодПоискаПечати.РабочийЦентр.ВидРабочегоЦентра;
								Если текПодВидРЦПечати = ВидРЦIndigo Тогда
									Продолжить;
								КонецЕсли;
								Если текПодВидРЦПечати = ВидРЦGallusInkjet Тогда
									Возврат 12;
								ИначеЕсли МассивРЦ.Найти(текПодВидРЦПечати) = Неопределено И ВМассивеРЦ Тогда
									Возврат 9;
								КонецЕсли;
							КонецЦикла;
							Возврат 2;
						ИначеЕсли МассивРЦ.Найти(текВидРЦ) <> Неопределено ИЛИ текНайденныеСтроки.Количество() > 0 Тогда		
							Возврат 2;	
						КонецЕсли;

						
						//ИначеЕсли текВидРЦПечати = ВидРЦCartes ИЛИ текВидРЦПечати = ВидРЦOmega ИЛИ текВидРЦПечати = ВидРЦIndigo 
						//	ИЛИ текВидРЦПечати = ВидРЦNewFoil ИЛИ текВидРЦПечати = ВидРЦGallusInkjet Тогда 
						//Для текНайденныеСтрокиПечать
						//Вид вырубки - Печать + вырубка в линию
					ИначеЕсли текВидРЦ <> ВидРЦIndigo И Не текЕстьИндиго Тогда	
						Если текВидРЦ = текВидРЦПечати Тогда
							Возврат 1;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			//КонецЕсли;
		КонецЦикла;
		Если МассивРЦ.Найти(текВидРЦ) <> Неопределено Тогда
			Возврат 8; //8. Заказ на Картес, Омега или НФ, без печати
		Иначе	
			Возврат 1; // Печати нет, но есть вырубка
		КонецЕсли;
	КонецЕсли;
	//Вид вырубки - Не был найден
	Возврат 0;

КонецФункции   // <-- Конец Лико Митюшин МФМ 18.03.2021

Функция ПолучитьВидВырубкиСекции(ЗаказСсылка, СпецификацияСсылка = Неопределено)  	
	
	Если ЗаказСсылка.КнижныйМодуль И ?(СпецификацияСсылка = Неопределено, Не ЗаказСсылка.Цифровой, Истина) Тогда 
		Возврат 13;
	КонецЕсли;
	
	//Предопределенные значения справочников, чтобы не получать несколько раз
	текВидПечать 	= Справочники.ВидыРаботСотрудников.Печать;
	ВидРЦSchober 	= Справочники.ВидыРабочихЦентров.Schober;
	ВидРЦIndigo 	= Справочники.ВидыРабочихЦентров.Indigo;
	ВидРЦCartes 	= Справочники.ВидыРабочихЦентров.Cartes;
	ВидРЦOmega	 	= Справочники.ВидыРабочихЦентров.Omega;
	ВидРЦNewFoil	= Справочники.ВидыРабочихЦентров.NewFoil;
	ВидРЦGallusInkjet	= Справочники.ВидыРабочихЦентров.GallusInkjet;
	ВидРЦOmet       = Справочники.ВидыРабочихЦентров.Omet;
	ВидРЦWeigang       = Справочники.ВидыРабочихЦентров.Weigang;
	//Добавлен дополнительтельно Татани 
	ВидРЦTatani		= Справочники.ВидыРабочихЦентров.Tatani;
	ВидРЦComexi		= Справочники.ВидыРабочихЦентров.Comexi;
	//Если Спецификация передаём строку Таблицы ПараметрыШтампа, Заказ - Заказ 
	Заказ = ЗаказСсылка;
	
	ОтборВырубка = Новый Структура;
	ОтборВырубка.Вставить("ВидСекции", Справочники.Лико_ВидыСекций.Вырубка);  
	
	ШтампЗаполнен = ЗначениеЗаполнено(Заказ.ШтампВырубной);
	Если ШтампЗаполнен Тогда 
		ОтборВырубка.Вставить("Оснастка", Заказ.ШтампВырубной);
	КонецЕсли;
	//Если Спецификация то меняем Строку Таблицы, на Спецификацию.
	// <-- Начало Лико Яцун С. В. 12.09.2024 
	//Спецификация рассчитывается как заказ
	//Если СпецификацияСсылка <> Неопределено Тогда 
	//	НомерВарианта = ЗаказСсылка.НомерВарианта;
	//	Заказ = СпецификацияСсылка;
	//	Если Не ШтампЗаполнен Тогда
	//		ПараметрыОтбора = Новый Структура;
	//		ПараметрыОтбора.Вставить("НомерСтроки", НомерВарианта);
	//		МассивВариантСпецификации = Заказ.ВариантыСпецификации.НайтиСтроки(ПараметрыОтбора);
	//		текЦифровой = ?(МассивВариантСпецификации.Количество() > 0, МассивВариантСпецификации[0].Цифровой, Ложь); 
	//	КонецЕсли;
	//Иначе 
	// <-- Конец Лико Яцун С. В. 12.09.2024
		//Для Заказа
		НомерВарианта = 1;
		текЦифровой = Заказ.Цифровой;
	//КонецЕсли;
	
	// <-- Начало Лико Яцун С. В. 09.06.2023 
	//текНайденныеСтрокиНумератор = Заказ.Секции.НайтиСтроки(Новый Структура("ВидСекции,НомерВарианта",Справочники.Лико_ВидыСекций.Нумератор,НомерВарианта));
	//Для Каждого ТекСтрока Из текНайденныеСтрокиНумератор Цикл
	//	Если ТекСтрока.РабочийЦентр.ВидРабочегоЦентра = ВидРЦOmega Тогда
	//		ТЗВидовРЦЗаказа = Новый ТаблицаЗначений;
	//		ТЗВидовРЦЗаказа.Колонки.Добавить("РабочийЦентр");
	//		Для Каждого РЦ Из Заказ.Секции Цикл
	//			Если РЦ.РабочийЦентр.ВидРабочегоЦентра = ВидРЦIndigo Тогда
	//				//Индиго + Омега с нумератором
	//				Возврат 16;
	//			КонецЕсли;
	//			НСВид = ТЗВидовРЦЗаказа.Добавить();
	//			НСВид.РабочийЦентр = РЦ.РабочийЦентр.ВидРабочегоЦентра;	
	//		КонецЦикла;
	//		ТЗВидовРЦЗаказа.Свернуть("РабочийЦентр");
	//		Если ТЗВидовРЦЗаказа.Количество() = 1 Тогда 
	//			//Только Омега с нумератором
	//			Возврат 17;   
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	// <-- Конец Лико Яцун С. В. 09.06.2023
	
	ОтборВырубка.Вставить("НомерВарианта", НомерВарианта);
	
	СтрокиВырубка = Заказ.Секции.НайтиСтроки(ОтборВырубка);
	
	// <-- Начало Лико Яцун С. В. 05.07.2023 
	//Печать без вырубки не ТУ Омет
	Если Заказ.ТипЗаказа <> Перечисления.Лико_ТипыЗаказов.Термоусадка И СтрокиВырубка.Количество() = 0 Тогда
		Для Каждого РЦ Из Заказ.Секции Цикл
			Если РЦ.РабочийЦентр.ВидРабочегоЦентра = ВидРЦOmet Тогда
				Возврат 18;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 05.07.2023
	// <-- Начало Лико Яцун С. В. 17.08.2023 
	//Печать без вырубки ТУ Омет
	Если Заказ.ТипЗаказа = Перечисления.Лико_ТипыЗаказов.Термоусадка И СтрокиВырубка.Количество() = 0 Тогда
		Для Каждого РЦ Из Заказ.Секции Цикл
			Если РЦ.РабочийЦентр.ВидРабочегоЦентра = ВидРЦOmet Тогда
				Возврат 19;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 17.08.2023
	
	Если СтрокиВырубка.Количество() = 0 Тогда
		//Вид вырубки - Печати без вырубки (круговые эт. и ТУ)
		Если Не ШтампЗаполнен Тогда 
			Если текЦифровой ИЛИ ЭтоПечатьНаИндигоСекции(Заказ)Тогда 
				Возврат 6;
			Иначе
				Возврат 5;
			КонецЕсли;
		КонецЕсли;
	Иначе
		//Массив РЦ для проверки
		МассивРЦ = Новый Массив;
		МассивРЦ.Добавить(ВидРЦCartes);
		МассивРЦ.Добавить(ВидРЦOmega);
		МассивРЦ.Добавить(ВидРЦNewFoil);
		МассивРЦ.Добавить(ВидРЦGallusInkjet);
		МассивРЦ.Добавить(ВидРЦTatani);
		МассивРЦ.Добавить(ВидРЦWeigang);

		текВидРЦ = Неопределено;    
		
			
		//Вид работ вырубка присутствиует, далее проверяем различные Виды вырубки.
		Для каждого ТекСтрока из СтрокиВырубка Цикл
			текВидРЦ = ТекСтрока.РабочийЦентр.ВидРабочегоЦентра;
			//Вид вырубки - Вырубка Шобер
			Если текВидРЦ = ВидРЦSchober Тогда
				Если ЭтоПечатьНаИндигоСекции(Заказ) Тогда
					Возврат 10;
				Иначе
					Возврат 4;
				КонецЕсли;
			КонецЕсли;

			//Вид вырубки - Вырубка Картес, Омега	
	
			СтрокиБезВырубки = ПолучитьСтрокиБезВырубки(текВидПечать, Заказ, НомерВарианта);
			//Добавлены Виды вырубки 14 и 15 для Tatani 
			Если текВидРЦ = ВидРЦTatani Тогда
				Если СтрокиБезВырубки.Количество() = 0 Тогда
					Возврат 15;
				Иначе 
					Для Каждого ТекСтрПачатиТотами из СтрокиБезВырубки Цикл
						//Если Вырубка Tatani и печать Comexi   
						Если ТекСтрПачатиТотами.РабочийЦентр.ВидРабочегоЦентра = ВидРЦComexi Тогда
							Возврат 14;	
						КонецЕсли;
					КонецЦикла;
					Возврат 15;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокиБезВырубки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			текЕстьИндиго = Ложь;
			Для Каждого текСтрокаПечати из СтрокиБезВырубки Цикл
				Если ВидРЦIndigo = текСтрокаПечати.РабочийЦентр.ВидРабочегоЦентра Тогда
					текЕстьИндиго = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого текСтрокаПечати из СтрокиБезВырубки Цикл
				текВидРЦПечати = текСтрокаПечати.РабочийЦентр.ВидРабочегоЦентра;
				ВМассивеРЦ = (МассивРЦ.Найти(текВидРЦ) <> Неопределено);
				Если ВМассивеРЦ И текВидРЦПечати <> ВидРЦIndigo И Не текЕстьИндиго Тогда 
					Если (текВидРЦПечати = текВидРЦ ИЛИ СтрокиБезВырубки.Количество() = 1) И текВидРЦ = ВидРЦGallusInkjet Тогда
						Возврат 7;	
					ИначеЕсли (МассивРЦ.Найти(текВидРЦПечати) <> Неопределено) И (текВидРЦПечати <> ВидРЦGallusInkjet И текВидРЦПечати <> ВидРЦIndigo) Тогда
						Возврат 8;
						//Вид вырубки - Печать Индиго + вырубка Картес, Омега
					ИначеЕсли текВидРЦПечати = ВидРЦGallusInkjet И текВидРЦ <> ВидРЦGallusInkjet Тогда
						Возврат 11;
					ИначеЕсли МассивРЦ.Найти(текВидРЦПечати) = Неопределено Тогда
						Возврат 3;	
					КонецЕсли;
					//Вид вырубки - Печать Индиго + вырубка Картес, Омега
				ИначеЕсли текВидРЦПечати = ВидРЦIndigo Тогда
					Если СтрокиБезВырубки.Количество() > 1 Тогда 
						Для каждого СтркаПодПоискаПечати из СтрокиБезВырубки Цикл
							текПодВидРЦПечати = СтркаПодПоискаПечати.РабочийЦентр.ВидРабочегоЦентра;
							Если текПодВидРЦПечати = ВидРЦIndigo Тогда
								Продолжить;
							КонецЕсли;
							Если текПодВидРЦПечати = ВидРЦGallusInkjet Тогда
								Возврат 12;
							ИначеЕсли МассивРЦ.Найти(текПодВидРЦПечати) = Неопределено И ВМассивеРЦ Тогда
								Возврат 9;
							КонецЕсли;
						КонецЦикла;
						Возврат 2;
					ИначеЕсли МассивРЦ.Найти(текВидРЦ) <> Неопределено ИЛИ СтрокиВырубка.Количество() > 0 Тогда		
						Возврат 2;	
					КонецЕсли;
					
					//Вид вырубки - Печать + вырубка в линию
				ИначеЕсли текВидРЦ <> ВидРЦIndigo И Не текЕстьИндиго Тогда	
					Если текВидРЦ = текВидРЦПечати Тогда
						Возврат 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Если МассивРЦ.Найти(текВидРЦ) <> Неопределено Тогда
			Возврат 8; //8. Заказ на Картес, Омега или НФ, без печати
		Иначе	
			Возврат 1; // Печати нет, но есть вырубка
		КонецЕсли;
	КонецЕсли;
	//Вид вырубки - Не был найден
	Возврат 0;

КонецФункции   

Функция ЭтоПечатьНаИндигоСекции(Заказ, текВидПечать = 0) Экспорт
	
	Для Каждого текСтрокаПечати из Заказ.Секции Цикл
		Если текСтрокаПечати.РабочийЦентр.ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.Indigo   Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции   

Функция ПолучитьСтрокиБезВырубки(текВидПечать, Заказ, НомерВарианта = 1)		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаСекции.РабочийЦентр КАК РабочийЦентр
		|ИЗ
		|	Документ.ЗаказКлиента.Секции КАК ЗаказКлиентаСекции
		|ГДЕ
		|	ЗаказКлиентаСекции.Ссылка = &Ссылка
		|	И ЗаказКлиентаСекции.ВидСекции <> ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Вырубка)";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	Возврат РезультатЗапроса;
	
КонецФункции 

Функция ПолучитьСтрокиПечати(текВидПечать, Заказ, НомерВарианта = 1) // --> Начало Лико Митюшин МФМ 18.03.2021
	
	текПараметрыОтбораПечать = Новый Структура;
	текПараметрыОтбораПечать.Вставить("ВидРабот", текВидПечать);
	//текПараметрыОтбораПечать.Вставить("НомерПроката", 1);
	текПараметрыОтбораПечать.Вставить("НомерВарианта", НомерВарианта);
				
	Возврат Заказ.ВидыРабот.НайтиСтроки(текПараметрыОтбораПечать);
	
КонецФункции // <-- Конец Лико Митюшин МФМ 18.03.2021

Функция ПолучитьМассивЛико_Предопределенные()  Экспорт 
	
	МассивЛико_Предопределенные = Новый Массив;
	МассивЛико_Предопределенные.Добавить(Справочники.Лико_ПредопределенныеЗначения.ЕИТысШт.ЗначениеПараметра); //[0]
	МассивЛико_Предопределенные.Добавить(Справочники.Лико_ПредопределенныеЗначения.ЕИПогМетр.ЗначениеПараметра); //[1]
	МассивЛико_Предопределенные.Добавить(Справочники.Лико_ПредопределенныеЗначения.ЕИКвадрМетр.ЗначениеПараметра); //[2]
	
	Возврат МассивЛико_Предопределенные;
КонецФункции

Функция РассчитатьМетражСВидомВырубки(Тираж, Заказ, текВидВырубки = Неопределено, СпецификацияСсылка = Неопределено) Экспорт  // --> Начало Лико Митюшин МФМ 29.03.2021
	//Заказ.ДлинаПечати = Заказ.Z.КоличествоЗубьев*3.175/1000;		
	//текВидВырубки = ПолучитьВидВырубки(Заказ, СпецификацияСсылка);
			
	Если ТекВидВырубки = 6 Тогда
		Если Заказ.РучьиПечатиИндиго = 0 Тогда
			Возврат 0;
		Иначе 
			Возврат Тираж / Заказ.РучьиПечатиИндиго * ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;
		КонецЕсли;
	ИначеЕсли ТекВидВырубки	= 1 Тогда
		МинЭтНалисте = Мин(?(Заказ.ЭтикетокНаЛисте = 0, Заказ.ЭтикетокНаЛистеПечати,  Заказ.ЭтикетокНаЛисте), ?(Заказ.ЭтикетокНаЛистеПечати = 0, Заказ.ЭтикетокНаЛисте, Заказ.ЭтикетокНаЛистеПечати)); 
		Если МинЭтНалисте = 0 ИЛИ Не ЗначениеЗаполнено(Заказ.Z.КоличествоЗубьев) Тогда
			Возврат 0;
		Иначе
			Возврат Тираж/МинЭтНалисте*((Заказ.Z.КоличествоЗубьев*3.175)*0.001);
		КонецЕсли;
	ИначеЕсли ТекВидВырубки = 7 ИЛИ ТекВидВырубки = 4 ИЛИ ТекВидВырубки = 8 Тогда
		Если Заказ.Ручьи = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0  Тогда
			Возврат 0;
		ИначеЕсли Заказ.РучьиПечати = 0 Тогда
			Возврат Тираж /Заказ.ЭтикетокНаЛисте*Заказ.ШагПечати;
		Иначе 
			Возврат Тираж /(Заказ.ЭтикетокНаЛисте*Заказ.РучьиПечати/Заказ.Ручьи)*Заказ.ШагПечати;
		КонецЕсли;
	ИначеЕсли ТекВидВырубки = 2 ИЛИ ТекВидВырубки = 10 Тогда
		Если Заказ.Ручьи = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0  Тогда
			Возврат 0;
		ИначеЕсли Заказ.РучьиПечатиИндиго = 0 Тогда
			Возврат Тираж /Заказ.ЭтикетокНаЛисте*Заказ.ШагПечати;
		Иначе 
			Возврат Тираж /(Заказ.ЭтикетокНаЛисте*Заказ.РучьиПечатиИндиго/Заказ.Ручьи)*Заказ.ШагПечати;
		КонецЕсли;	
	ИначеЕсли текВидВырубки = 13 тогда
		Если Заказ.Ручьи = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0  Тогда
			Возврат 0;
		Иначе
			Возврат  Тираж/Заказ.ЭтикетокНаЛисте *((Заказ.Z.КоличествоЗубьев*3.175)*0.001);	
		КонецЕсли;
	ИначеЕсли текВидВырубки = 15 тогда
		Если Заказ.ШагПечати = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0  Тогда
			Возврат 0;
		Иначе 
			Возврат Тираж /(Заказ.ЭтикетокНаЛисте)*Заказ.ШагПечати;
		КонецЕсли;
	ИначеЕсли текВидВырубки = 18 Тогда
		Если Заказ.РучьиПечати = 0 Тогда
			Возврат 0;
		Иначе 
			Возврат (Тираж / Заказ.РучьиПечати) * Заказ.ШиринаЭтикетки * 0.001;
		КонецЕсли;
	ИначеЕсли текВидВырубки = 19 Тогда
		Если Заказ.РучьиПечати = 0 Тогда
			Возврат 0;
		Иначе 
			Возврат (Тираж / Заказ.РучьиПечати) * Заказ.ДлинаЭтикетки * 0.001;
		КонецЕсли;
	КонецЕсли;

	Возврат РассчитатьМетражПоСтарому(Тираж, Заказ.ЭтикетокНаЛисте, Заказ.ШагПечати, Заказ.Z, Заказ.ЭтикетокНаЛистеПечати, текВидВырубки, Заказ.ДлинаПечати);
	
КонецФункции // <-- Конец Лико Митюшин МФМ 29.03.2021

Процедура ЗаполнитьПараметрыПечати(Заказ, текВидВырубки = Неопределено, СпецификацияСсылка = Неопределено, ПересчетПараметров = Ложь) Экспорт // --> Начало Лико Митюшин МФМ 18.05.2021

	Если текВидВырубки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаСПрипуском = Неопределено;
	КоличествоПоДлинеРапорта = Неопределено;
	Заказ.ЭтикетокНаЛистеПечати = ПолучитьЭтикетокНаЛистеПечати(Заказ, текВидВырубки, СпецификацияСсылка, ДлинаСПрипуском, КоличествоПоДлинеРапорта);
	Если НЕ (текВидВырубки = 5 И ПересчетПараметров = Ложь) Тогда
		Заказ.ДлинаПечати = ПолучитьДлинуПечати(Заказ, текВидВырубки, СпецификацияСсылка, ДлинаСПрипуском, КоличествоПоДлинеРапорта);
	КонецЕсли;
	
КонецПроцедуры // <-- Конец Лико Митюшин МФМ 18.05.2021

Функция ПолучитьЭтикетокНаЛистеПечати(Заказ, текВидВырубки, СпецификацияСсылка = Неопределено, ДлинаСПрипуском = 0, КоличествоПоДлинеРапорта = 0) Экспорт
	
	Если текВидВырубки = 3 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 12 ИЛИ (текВидВырубки = 5 И НЕ ЭтоТермоусадка(Заказ, СпецификацияСсылка)) Тогда 
		текКоэфДеления = ?(ЭтоКомлект(Заказ, СпецификацияСсылка), 0.5, 1);
	Иначе
		текКоэфДеления = 1;
	КонецЕсли;
	
	Если текВидВырубки = 1 ИЛИ текВидВырубки = 13 Тогда 
		Возврат ?(ЗначениеЗаполнено(Заказ.Ручьи),  Заказ.ЭтикетокНаЛисте * Заказ.РучьиПечати / Заказ.Ручьи, 0);
	//ИначеЕсли текВидВырубки = 2 Тогда
	//	Если НЕ (Заказ.ШагПечати = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0 ИЛИ Заказ.Ручьи = 0) Тогда 
	//		ДлинаСПрипуском = Заказ.ШагПечати/(Заказ.ЭтикетокНаЛисте/Заказ.Ручьи);
	//		Если ДлинаСПрипуском <> 0 Тогда
	//			КоличествоПоДлинеРапорта = Цел(0.98/ДлинаСПрипуском);
	//			Возврат КоличествоПоДлинеРапорта * Заказ.РучьиПечати;
	//		КонецЕсли;
	//	КонецЕсли;		
	ИначеЕсли текВидВырубки = 3 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 14 ИЛИ текВидВырубки = 18 ИЛИ текВидВырубки = 19 Тогда 
		//ШиринаИлиДлинаЭтикетки = ?(ЭтоУрал(Заказ), Заказ.ДлинаЭтикетки, Заказ.ШиринаЭтикетки);
		//Возврат ?(ШиринаИлиДлинаЭтикетки = 0 ИЛИ Заказ.ДлинаПечати = 0, 0,
		//	Цел(Заказ.ДлинаПечати / (ШиринаИлиДлинаЭтикетки * 0.001)) * Заказ.РучьиПечати); 	
		Возврат Заказ.КоличествоЭтПоДлинеПечати * Заказ.РучьиПечати* текКоэфДеления;
	ИначеЕсли текВидВырубки = 4 Тогда 
		Возврат  ?(ЗначениеЗаполнено(Заказ.Ручьи),  Заказ.ЭтикетокНаЛисте * Заказ.ДлинаПечати /  Заказ.ШагПечати  * Заказ.РучьиПечати / Заказ.Ручьи, 0);
	ИначеЕсли ТекВидВырубки = 5 Тогда // Не понятно, разные формулы
		Если Заказ.ЭтМЭР = 0 Тогда 
			Возврат 0;
		КонецЕсли;
		//Необходимо повторно считать для точности в рассчетах
		текЭтМЭР = Заказ.ЭтМЭР;
		Если ЭтоТермоусадка(Заказ, СпецификацияСсылка) Тогда
			текЭтМЭР = Заказ.ДлинаЭтикетки * 0.001;
			Возврат Окр(Заказ.ДлинаПечати / текЭтМЭР)*Заказ.РучьиПечати * текКоэфДеления;
		Иначе 
			ДлинаИлиШирина = ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;
			Если Не (Заказ.ДлинаПечати = 0 ИЛИ Цел(Заказ.ДлинаПечати / ДлинаИлиШирина) = 0) Тогда 	
				текЭтМЭР = Заказ.ДлинаПечати / Цел(Заказ.ДлинаПечати / ДлинаИлиШирина);
			КонецЕсли;
			Возврат Цел(Заказ.ДлинаПечати / текЭтМЭР)*Заказ.РучьиПечати* текКоэфДеления;
		КонецЕсли;
		
		//ДлиннаИлиШиринаЭтикетки = ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001; 
		//Возврат ?(ДлиннаИлиШиринаЭтикетки = 0 ИЛИ Заказ.РучьиПечати = 0, 0, Цел(Заказ.ДлинаПечати / ДлиннаИлиШиринаЭтикетки) * Заказ.РучьиПечати);  
	//ИначеЕсли ТекВидВырубки = 6 Тогда
	//	ДлинаСПрипуском = ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;
	//	Если ДлинаСПрипуском <> 0 Тогда
	//		КоличествоПоДлинеРапорта = Цел(0.98/ДлинаСПрипуском);
	//		Возврат КоличествоПоДлинеРапорта * Заказ.РучьиПечати;
	//	КонецЕсли;
	// <-- Начало Лико Яцун С. В. 09.06.2023	
	//ИначеЕсли текВидВырубки = 7 ИЛИ текВидВырубки = 8 Тогда 
	ИначеЕсли текВидВырубки = 7 ИЛИ текВидВырубки = 8 Тогда 
	// <-- Конец Лико Яцун С. В. 09.06.2023	
		Возврат ?(ЗначениеЗаполнено(Заказ.Ручьи),  Заказ.ЭтикетокНаЛисте * Заказ.РучьиПечати / Заказ.Ручьи, 0);
	ИначеЕсли текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда
		Возврат Окр(Заказ.КоличествоЭтПоДлинеПечати * Заказ.РучьиПечати)* текКоэфДеления;
	КонецЕсли;

КонецФункции

Процедура ОчиститьНеИспользуемыПараметрыШтампа(Заказ, текВидВырубки = 0) Экспорт
	
	Если текВидВырубки = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 8 ИЛИ текВидВырубки = 10 Тогда
		Заказ.Z = Справочники.Лико_ZКоличествоЗубьев.ПустаяСсылка();
	ИначеЕсли ТекВидВырубки = 4 Тогда
		//Заказ.ШиринаЭтикетки 	= 0;
		//Заказ.ДлинаЭтикетки  	= 0;
		Заказ.ЭтМЭР				= 0;
	ИначеЕсли ТекВидВырубки = 5 ИЛИ ТекВидВырубки = 6 Тогда
		Заказ.ШагПечати = 0;
		Заказ.ЭтикетокНаЛисте = 0;
		Заказ.Ручьи = 0;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЭтикетокНаЛистеПечатиФлексо(Заказ, СпецификацияСсылка = Неопределено) Экспорт
	Если Заказ.ЭтМЭР = 0 Тогда 
		Возврат 0;
	Иначе 
		Возврат Заказ.ДлинаПечати / Заказ.ЭтМЭР; 	
	КонецЕсли;
КонецФункции	

Функция ПолучитьДлинуПечати(Заказ, текВидВырубки, СпецификацияСсылка = Неопределено, ДлинаСПрипуском = Неопределено, КоличествоПоДлинеРапорта = Неопределено) Экспорт
	
	Если текВидВырубки = 1 ИЛИ текВидВырубки = 3 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 13 Тогда 
		Возврат Заказ.Z.КоличествоЗубьев * 3.175/1000;
	ИначеЕсли текВидВырубки = 4 Тогда 
		Возврат ?(Заказ.ШагПечати = 0.944, 0.472, Заказ.ШагПечати);
	ИначеЕсли текВидВырубки = 7 Тогда 
		Возврат Заказ.ШагПечати;
	ИначеЕсли текВидВырубки = 6 Тогда 
		ДлинаИлиШирина = ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) ; 
		текРазмер = 70/ДлинаИлиШирина;
		текДлинаИлиШирина = ?(текРазмер-Цел(текРазмер) = 0, Цел(текРазмер), Цел(текРазмер) + 1);       
		Возврат текДлинаИлиШирина*ДлинаИлиШирина* 0.001;      
	ИначеЕсли текВидВырубки = 18 ИЛИ текВидВырубки = 19 Тогда
		МассивРаппортов = Новый Массив;
		РаппортДляСравненияУжеВыбран = Справочники.Лико_Раппорты.ПустаяСсылка();
		Если текВидВырубки = 18 Тогда
			РазмерЭтикетки = Заказ.ШиринаЭтикетки
		Иначе
			РазмерЭтикетки = Заказ.ДлинаЭтикетки
		КонецЕсли;
		Для КоличЭтПоДлине = 1 По Цел(630/РазмерЭтикетки) Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Лико_Раппорты.ДлинаПечати / 1000 КАК ДлинаПечати,
			|	Лико_Раппорты.Мин КАК Мин,
			|	Лико_Раппорты.Макс КАК Макс,
			|	Лико_Раппорты.Ссылка КАК Раппорт
			|ИЗ
			|	Справочник.Лико_Раппорты КАК Лико_Раппорты
			|ГДЕ
			|	Лико_Раппорты.Мин <= &НоминальныйРазмерЭтикетки
			|	И Лико_Раппорты.Макс >= &НоминальныйРазмерЭтикетки
			|	И Лико_Раппорты.Ссылка В
			|			(ВЫБРАТЬ
			|				Лико_РаппортыРабочиеЦентры.Ссылка КАК Ссылка
			|			ИЗ
			|				Справочник.Лико_Раппорты.РабочиеЦентры КАК Лико_РаппортыРабочиеЦентры
			|			ГДЕ
			|				Лико_РаппортыРабочиеЦентры.РабочийЦентр.ВидРабочегоЦентра = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.Omet))
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДлинаПечати";
			
			НоминальныйРазмерЭтикетки = (РазмерЭтикетки + ((Заказ.ДопускПлюс - Заказ.ДопускМинус) / 2)) * КоличЭтПоДлине;
			Запрос.УстановитьПараметр("НоминальныйРазмерЭтикетки", НоминальныйРазмерЭтикетки);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			НеточностьРаппорта = Неопределено;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если НеточностьРаппорта <> Неопределено 
					И (Макс(ВыборкаДетальныеЗаписи.Раппорт.ДлинаПечати, НоминальныйРазмерЭтикетки) - Мин(ВыборкаДетальныеЗаписи.Раппорт.ДлинаПечати, НоминальныйРазмерЭтикетки)) < НеточностьРаппорта Тогда
					НеточностьРаппорта = Макс(ВыборкаДетальныеЗаписи.Раппорт.ДлинаПечати, НоминальныйРазмерЭтикетки) - Мин(ВыборкаДетальныеЗаписи.Раппорт.ДлинаПечати, НоминальныйРазмерЭтикетки);
					ПодходящийРаппорт = ВыборкаДетальныеЗаписи.Раппорт;
				ИначеЕсли НеточностьРаппорта = Неопределено Тогда
					НеточностьРаппорта = Макс(ВыборкаДетальныеЗаписи.Раппорт.ДлинаПечати, НоминальныйРазмерЭтикетки) - Мин(ВыборкаДетальныеЗаписи.Раппорт.ДлинаПечати, НоминальныйРазмерЭтикетки);
					ПодходящийРаппорт = ВыборкаДетальныеЗаписи.Раппорт;
				КонецЕсли;
			КонецЦикла;
			
			Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
				Продолжить;
			Иначе
				Если ПодходящийРаппорт = РаппортДляСравненияУжеВыбран Тогда
					Продолжить;
				КонецЕсли;
				СтруктураРаппортов = Новый Структура;
				СтруктураРаппортов.Вставить("Раппорт",ПодходящийРаппорт);
				СтруктураРаппортов.Вставить("НеточностьРаппорта",НеточностьРаппорта);
				МассивРаппортов.Добавить(СтруктураРаппортов);
				РаппортДляСравненияУжеВыбран = ПодходящийРаппорт;
			КонецЕсли;
		КонецЦикла;
		НужныйРаппорт = СравнитьИВыбратьРаппорт(Заказ,МассивРаппортов);
		Если НужныйРаппорт = Неопределено Тогда
			Возврат Неопределено;	
		Иначе	
			СтруктураРаппортИДлинаПечатиОмет = Новый Структура("Раппорт,ДлинаПечати",НужныйРаппорт,НужныйРаппорт.ДлинаПечати/1000);
			Возврат СтруктураРаппортИДлинаПечатиОмет; 
		КонецЕсли;
	ИначеЕсли ТекВидВырубки <> 0 Тогда 
		Возврат 0; 
	КонецЕсли;

КонецФункции

Функция СравнитьИВыбратьРаппорт(Заказ,МассивРаппортов)

	Если МассивРаппортов.Количество() = 1 Тогда
		Возврат МассивРаппортов[0].Раппорт;  
	КонецЕсли;
	
	Если Заказ.ВидЗаказа = Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
    	КоличествоФорм = 1;
	Иначе
		КоличествоФорм = Заказ.Цвета.НайтиСтроки(Новый Структура("РабочийЦентр,Цветоделение",Справочники.РабочиеЦентры.НайтиПоРеквизиту("ВидРабочегоЦентра",Справочники.ВидыРабочихЦентров.Omet),Истина)).Количество(); 
	КонецЕсли;
	Если КоличествоФорм = 0 Тогда
		Сообщить("Не удалось подобрать Раппорт. Сначала укажите цвтоделение");
		Возврат Неопределено;
	КонецЕсли;
	Нарезка = Заказ.Нарезка.Размер / 1000;
	ЦенаПолимера = Лико_Планирование.ЦенаЦеновойГруппы(Справочники.ЦеновыеГруппы.ПолимерДляФлексоКлише, ТекущаяДата() , Заказ.Площадка.Организация);
	Тираж = Заказ.Тираж * 1000;
	СтоимостьТиража = ?(ЗначениеЗаполнено(Заказ.СуммаДокумента),Заказ.СуммаДокумента,1);
	НужныйРаппорт = Неопределено;
	ДлинаПечатиКороткая = Неопределено;
	НеточностьРаппортаКороткойФормы = Неопределено;
	Для каждого ЭлСтруктуры Из МассивРаппортов Цикл
		КоличествоФорм = КоличествоФорм;
		ДлинаПечатиДлинная = ?(ЗначениеЗаполнено(ДлинаПечатиКороткая),ЭлСтруктуры.Раппорт.ДлинаПечати,Неопределено);
		ДлинаПечатиКороткая = ?(ЗначениеЗаполнено(ДлинаПечатиКороткая),ДлинаПечатиКороткая,ЭлСтруктуры.Раппорт.ДлинаПечати);
		ПлощадьКороткойФормы = КоличествоФорм * Нарезка * ДлинаПечатиКороткая / 1000;
		ПлощадьДлиннойФормы = ?(ЗначениеЗаполнено(ДлинаПечатиДлинная),КоличествоФорм * Нарезка * ДлинаПечатиДлинная / 1000,Неопределено);
		ЦенаПолимера = ЦенаПолимера;
		СтоимостьКороткойФормы = ЦенаПолимера * ПлощадьКороткойФормы;
		СтоимостьДлиннойФормы = ?(ЗначениеЗаполнено(ПлощадьДлиннойФормы),ЦенаПолимера * ПлощадьДлиннойФормы,Неопределено);
		Разница = ?(ЗначениеЗаполнено(СтоимостьДлиннойФормы),Макс(СтоимостьДлиннойФормы,СтоимостьКороткойФормы) - Мин(СтоимостьДлиннойФормы,СтоимостьКороткойФормы),Неопределено); 
		РазницаСтоимость = ?(ЗначениеЗаполнено(Разница),Разница / СтоимостьТиража,Неопределено); 
		КоэффициентПоДлине = Справочники.Лико_КоэффициентыДляРасчетов.КоэффициентФормы.Значение;
		ИтогоКороткаяФорма = ?(ЗначениеЗаполнено(РазницаСтоимость),РазницаСтоимость * КоэффициентПоДлине,Неопределено);
		НеточностьРаппортаДлиннойФормы = ?(ЗначениеЗаполнено(НеточностьРаппортаКороткойФормы),ЭлСтруктуры.НеточностьРаппорта,Неопределено);
		НеточностьРаппортаКороткойФормы = ?(ЗначениеЗаполнено(НеточностьРаппортаКороткойФормы),НеточностьРаппортаКороткойФормы,ЭлСтруктуры.НеточностьРаппорта);
		РазницаВНеточностиРаппорта = ?(ЗначениеЗаполнено(НеточностьРаппортаДлиннойФормы),Макс(НеточностьРаппортаДлиннойФормы,НеточностьРаппортаКороткойФормы) - Мин(НеточностьРаппортаДлиннойФормы,НеточностьРаппортаКороткойФормы),Неопределено);
		КоэффициентПоНеточности = Справочники.Лико_КоэффициентыДляРасчетов.КоэффициентНеточности.Значение;
		ИтогоДлиннаяФорма = ?(ЗначениеЗаполнено(РазницаВНеточностиРаппорта),РазницаВНеточностиРаппорта * КоэффициентПоНеточности,Неопределено);
		Если НЕ ЗначениеЗаполнено(НужныйРаппорт) Тогда
			НужныйРаппорт = ЭлСтруктуры.Раппорт;	
		КонецЕсли;
		Если ЗначениеЗаполнено(ИтогоДлиннаяФорма) И ИтогоДлиннаяФорма > ИтогоКороткаяФорма Тогда 
			ДлинаПечатиКороткая = ЭлСтруктуры.Раппорт.ДлинаПечати;
			НеточностьРаппортаКороткойФормы = ЭлСтруктуры.НеточностьРаппорта;
			НужныйРаппорт = ЭлСтруктуры.Раппорт;
		КонецЕсли;
	КонецЦикла; 
	Возврат НужныйРаппорт;
	
КонецФункции	

Функция ПолучитьМежэтикеточноеРасстояние(Заказ, текВидВырубки, СпецификацияСсылка = Неопределено) Экспорт
	
	Если текВидВырубки = 1 ИЛИ текВидВырубки = 13 Тогда
		Если Заказ.ДлинаПечати = 0 ИЛИ Заказ.ЭтикетокНаЛистеПечати = 0 ИЛИ Заказ.РучьиПечати = 0 Тогда
			Возврат 0;
		Иначе
			Возврат Заказ.ДлинаПечати / (Заказ.ЭтикетокНаЛистеПечати / Заказ.РучьиПечати);	
		КонецЕсли;
	ИначеЕсли текВидВырубки = 2 ИЛИ текВидВырубки = 3 ИЛИ текВидВырубки = 7 ИЛИ текВидВырубки = 8 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 11
		ИЛИ текВидВырубки = 12 ИЛИ текВидВырубки = 14 ИЛИ текВидВырубки = 15 Тогда
		Если Заказ.ШагПечати = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0 ИЛИ Заказ.Ручьи = 0 Тогда
			Возврат 0;
		Иначе		
			Возврат Заказ.ШагПечати / (Заказ.ЭтикетокНаЛисте / Заказ.Ручьи);
		КонецЕсли
	ИначеЕсли текВидВырубки = 5 Тогда 
		Если ЭтоТермоусадка(Заказ, СпецификацияСсылка) Тогда
			Возврат Заказ.ДлинаЭтикетки * 0.001;
		Иначе 
			ДлинаИлиШирина = ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;
			Если Заказ.ДлинаПечати = 0 ИЛИ Цел(Заказ.ДлинаПечати / ДлинаИлиШирина) = 0 Тогда 
				Возврат 0;
			Иначе		
				Возврат Заказ.ДлинаПечати / Цел(Заказ.ДлинаПечати / ДлинаИлиШирина);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли текВидВырубки = 6 Тогда 
		Возврат ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;	
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЭтоУрал(Заказ, СпецификацияСсылка = Неопределено) Экспорт
	//Заказ - может быть Заказ или Спецификация
	 Возврат ?(СпецификацияСсылка = Неопределено, Заказ.Площадка, СпецификацияСсылка.Площадка) = Справочники.Лико_Площадки.Урал;
КонецФункции

Функция ЭтоТермоусадка(Заказ, СпецификацияСсылка = Неопределено) Экспорт
	Возврат ?(СпецификацияСсылка = Неопределено, Заказ.ТипЗаказа, СпецификацияСсылка.ТипЗаказа) = Перечисления.Лико_ТипыЗаказов.Термоусадка;	
КонецФункции

Функция ЭтоКомлект(Заказ, СпецификацияСсылка = Неопределено) Экспорт
	//Заказ - может быть Заказ или Спецификация
	ТекТабТовары = ?(СпецификацияСсылка = Неопределено, Заказ.Товары, СпецификацияСсылка.Товары);
	Если ТекТабТовары.Количество() > 0 Тогда
		Возврат ТекТабТовары[0].Номенклатура.Лико_ТипЭтикетки = Перечисления.Лико_ТипыЭтикеток.Комплект;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка = Неопределено) Экспорт
	Если ЭтоТермоусадка(Заказ, СпецификацияСсылка) Тогда
		Возврат ?(ЭтоУрал(Заказ, СпецификацияСсылка), Заказ.ШиринаЭтикетки, Заказ.ДлинаЭтикетки); // Не Урал Длина
	Иначе 
		Возврат ?(ЭтоУрал(Заказ, СпецификацияСсылка), Заказ.ДлинаЭтикетки, Заказ.ШиринаЭтикетки); // Не Урал Ширина
	КонецЕсли;
КонецФункции

Процедура ПолучитьМетражПоУсловиям(МассивЛико_Предопределенные, ЕдинИзм, Количество, ПогонныйМетраж, КвадратныйМетраж, Нарезка, СтрКоличество, Объект) Экспорт 
	
	Если ЕдинИзм = МассивЛико_Предопределенные[0] Тогда
		Количество = СтрКоличество*1000;
		ПогонныйМетраж = РассчитатьМетражСВидомВырубки(количество, Объект, Объект.ВидВырубки);
		КвадратныйМетраж = ПогонныйМетраж*Нарезка;
	ИначеЕсли ЕдинИзм = МассивЛико_Предопределенные[1] Тогда
		ПогонныйМетраж = СтрКоличество;
		КвадратныйМетраж  = ПогонныйМетраж*Нарезка;
		Количество = ПогонныйМетраж; 
	ИначеЕсли  ЕдинИзм = МассивЛико_Предопределенные[2]  Тогда
		КвадратныйМетраж  = СтрКоличество;
		ПогонныйМетраж = СтрКоличество/Нарезка;
		Количество = КвадратныйМетраж;
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчитатьТиражМетраж(Объект) Экспорт
	
	МетражКвМ = 0;
	МетражПМ = 0;
	КоличествоОбщее = 0;
	Нарезка = Объект.Нарезка.Размер/1000;
	
	//Предопределенные значения
	МассивЛико_Предопределенные = ПолучитьМассивЛико_Предопределенные();
	
	Для каждого стр из Объект.Товары Цикл
		Количество 			= 0;
		ПогонныйМетраж 		= 0;
		КвадратныйМетраж 	= 0;
		Если ЗначениеЗаполнено(Нарезка)  Тогда 
			ПолучитьМетражПоУсловиям(МассивЛико_Предопределенные, стр.Номенклатура.ЕдиницаИзмерения, Количество, ПогонныйМетраж, КвадратныйМетраж, Нарезка, стр.Количество, Объект);
			МетражКвМ  = МетражКВМ + КвадратныйМетраж;
			МетражПМ = МетражПМ + ПогонныйМетраж;
			КоличествоОбщее = КоличествоОбщее + Количество;
		КонецЕсли;
	КонецЦикла;
	Если Объект.МетражКВМ <> МетражКВМ Тогда 
		Объект.МетражКВМ = МетражКВМ;
	КонецЕсли;
	Если Объект.МетражПМ <> МетражПМ Тогда 
		Объект.МетражПМ = МетражПМ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияЗаказа) ИЛИ Объект.ЕдиницаИзмеренияЗаказа = МассивЛико_Предопределенные[0] Тогда
		Если Объект.Тираж <> КоличествоОбщее/1000 Тогда 
			Объект.Тираж = КоличествоОбщее/1000;
		КонецЕсли;
	Иначе 
		Если Объект.Тираж <> КоличествоОбщее Тогда 
			Объект.Тираж = КоличествоОбщее;
		КонецЕсли;
	КонецЕсли;
	
	Если МетражКВМ = 0 Тогда 
		Объект.ШТКВМ = 0;
	Иначе 
		Если Объект.ШТКВМ <> Окр(КоличествоОбщее/МетражКВМ,8) Тогда 
			Объект.ШТКВМ = Окр(КоличествоОбщее/МетражКВМ,8) 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьМетражПоСтарому(тираж, ЭтикетокНаЛисте, шагпечати, Z, ЭтикетокНаЛистеПечати = 0, ВидВырубки = 0, ДлинаПечати = 0)  Экспорт
	// --> Начало Лико Митюшин МФМ 09.03.2021
	//Заполнение расчетных полей
	Если ВидВырубки <> 0 И ЭтикетокНаЛистеПечати <> 0 Тогда
		//Если ВидВырубки = 1 ТОГДА
		//	Возврат Окр((тираж/?(ЭтикетокНаЛисте = 0,ЭтикетокНаЛистеПечати,Мин(ЭтикетокНаЛистеПечати, ЭтикетокНаЛисте))) * ДлинаПечати, 2);
		Если ВидВырубки = 3 ИЛИ ВидВырубки = 5 ИЛИ ВидВырубки = 9 ИЛИ ВидВырубки = 11 ИЛИ ВидВырубки = 12 ИЛИ ВидВырубки = 14 Тогда                 
			Возврат Окр((тираж/ЭтикетокНаЛистеПечати) * ДлинаПечати, 2); 
		КонецЕсли;
	КонецЕсли;
	// <-- Конец Лико Митюшин МФМ 09.03.2021

	ПогонныйМетраж =0;
	Если ЗначениеЗаполнено(ЭтикетокНаЛисте) Тогда 
		Если ЗначениеЗаполнено(Z) Тогда
			ПогонныйМетраж = Окр((тираж/ЭтикетокНаЛисте)*(Z.КоличествоЗубьев*3.175/1000),2);
		ИначеЕсли ЗначениеЗаполнено(ШагПечати) Тогда
			ПогонныйМетраж = Окр((тираж/ЭтикетокНаЛисте)*ШагПечати, 2);
		КонецЕсли;					
	КонецЕсли;
	Возврат ПогонныйМетраж;

КонецФункции

Функция РассчитатьМетраж(Тираж, Нарезка, ШтКВМ)  Экспорт
	Возврат ? (Тираж = 0 ИЛИ Нарезка = 0 ИЛИ ШтКВМ = 0, 0, Тираж / ШтКВМ / Нарезка.Размер * 1000);
КонецФункции

//Функция РассчитатьТираж(ПогонныйМетраж,ЭтикетокНаЛисте,Z, ШагПечати, ДлинаПечати= 0, ЭтикетокнаЛистепечати = 0, ВидВырубки = 0) Экспорт
//	Тираж =0;
//	Если (ВидВырубки = 1 ИЛИ  ВидВырубки = 3 ИЛИ ВидВырубки = 5) И ЭтикетокНаЛистеПечати>0 И ДлинаПечати>0 Тогда
//		Возврат Окр(ПогонныйМетраж*ЭтикетокНаЛистеПечати/(Длинапечати*1000),2);
//	ИначеЕсли   ВидВырубки = 2  И ЭтикетокНаЛистеПечати>0 И ШагПечати>0 Тогда
//		Возврат Окр(ПогонныйМетраж*ЭтикетокНаЛистеПечати/(ШагПечати*1000),2);
//	ИначеЕсли  ВидВырубки = 4  Тогда
//		Возврат Окр(ПогонныйМетраж*ЭтикетокНаЛисте/(ШагПечати*1000),2);
//	Иначе 
//		Если ЗначениеЗаполнено(ЭтикетокНаЛисте) Тогда 
//			Если ЗначениеЗаполнено(Z) Тогда
//				Тираж = Окр(ПогонныйМетраж*ЭтикетокНаЛисте/(Z.КоличествоЗубьев*3.175),2);
//			ИначеЕсли ЗначениеЗаполнено(ШагПечати) Тогда
//				//ПогонныйМетраж = Окр((тираж*1000/Стр.ЭтикетокНаЛисте)*Стр.ШагПечати, 2);
//				Тираж = Окр(ПогонныйМетраж*ЭтикетокНаЛисте/(ШагПечати*1000),2);
//			КонецЕсли;					
//		КонецЕсли;
//		Возврат Тираж;
//	КонецЕсли;	
//		
//КонецФункции

Функция РассчитатьТираж(ПогонныйМетраж, Нарезка, ШтКВМ)  Экспорт
	Возврат ПогонныйМетраж * 0.001 * (Нарезка.Размер * 0.001) * ШтКВМ;	
КонецФункции		

Функция РассчитатьКВМ(ШТКВМ, МетражКВМ, КоличествоОбщее)	Экспорт

	Если МетражКВМ = 0 Тогда
		Возврат 0;
	Иначе
		Если ШТКВМ <> Окр(КоличествоОбщее/МетражКВМ,8) Тогда 
			Возврат Окр(КоличествоОбщее/МетражКВМ,8) 
		КонецЕсли;
	КонецЕсли;

КонецФункции

Функция РучьиОтШтампа(Заказ) Экспорт  // --> Начало Лико Митюшин МФМ 07.04.2021
	Возврат ?(ЗначениеЗаполнено(Заказ.Ручьи), Заказ.Ручьи,  ?(ЗначениеЗаполнено(Заказ.РучьиПечати), Заказ.РучьиПечати, Заказ.РучьиПечатиИндиго));
КонецФункции // <-- Конец Лико Митюшин МФМ 07.04.2021

Функция РасчетКоличестваПеремотки(Заказ, ВидВырубки = 0, ИскатьВидВырубки = Истина, СпецификацияСсылка = Неопределено) Экспорт // --> Начало Лико Митюшин МФМ 29.04.2021
	
	Если ИскатьВидВырубки Тогда
		ВидВырубки = Лико_ТиражМетраж.ПолучитьВидВырубки(Заказ, СпецификацияСсылка); 
	КонецЕсли;
	
	Если ВидВырубки = 0 ИЛИ ВидВырубки = 4 Тогда 
		Возврат 0;		
	ИначеЕсли ВидВырубки = 1 ИЛИ ВидВырубки = 13 Тогда 
		Если Заказ.ДлинаПечати = 0 ИЛИ Заказ.ЭтикетокНаЛистеПечати = 0 ИЛИ Заказ.РучьиПечати = 0 Тогда 
			Возврат 0;
		Иначе 
			Возврат Заказ.ДлинаПечати / (Заказ.ЭтикетокНаЛистеПечати / Заказ.РучьиПечати);
		КонецЕсли;
	ИначеЕсли ВидВырубки = 2 ИЛИ ВидВырубки = 3 ИЛИ ВидВырубки = 7 ИЛИ ВидВырубки = 8 ИЛИ ВидВырубки = 11 ИЛИ ВидВырубки = 14 ИЛИ ВидВырубки = 15 Тогда
		Если Заказ.ШагПечати = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0 ИЛИ Заказ.Ручьи = 0 Тогда 
			Возврат 0;
		Иначе 
			Возврат Заказ.ШагПечати / (Заказ.ЭтикетокНаЛисте / Заказ.Ручьи);
		КонецЕсли;
	ИначеЕсли ВидВырубки = 5 ИЛИ ВидВырубки = 6 ИЛИ ВидВырубки = 18 ИЛИ ВидВырубки = 19 Тогда 
		Возврат ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;
	Иначе 
		Возврат Заказ.ЭтМЭР; 	
	КонецЕсли;
	
КонецФункции // <-- Конец Лико Митюшин МФМ 29.04.2021

Функция ИзменитьПриСменеВидаВырубки(Заказ, ПересчитыватьМетраж = Истина, ПересчитатьПоля = Ложь, СпецификацияСсылка = Неопределено) Экспорт
	текВидВырубки = ПолучитьВидВырубки(Заказ, СпецификацияСсылка);
	текБылиИзменения = Ложь;
	Если текВидВырубки <> Заказ.ВидВырубки ИЛИ ПересчитатьПоля Тогда 
		Заказ.ВидВырубки = текВидВырубки;
		текБылиИзменения = ПроверкаИзмененияВидВырубки(Заказ, ПересчитыватьМетраж);
	КонецЕсли;
	
	Возврат текБылиИзменения;
КонецФункции

Функция ПроверкаИзмененияВидВырубки(Заказ, ПересчитыватьМетраж = Истина) Экспорт
	// --> Начало Лико Митюшин МФМ 19.05.2021
	текБылиИзменения = Ложь;
	
	текЭтикетокНаЛистеПечати =  Лико_ТиражМетраж.ПолучитьЭтикетокНаЛистеПечати(Заказ, Заказ.ВидВырубки);
	Если текЭтикетокНаЛистеПечати <> Заказ.ЭтикетокНаЛистеПечати Тогда
		Заказ.ЭтикетокНаЛистеПечати 	= текЭтикетокНаЛистеПечати;
		текБылиИзменения = Истина;
	КонецЕсли;
	
	текДлинаПечати = Лико_ТиражМетраж.ПолучитьДлинуПечати(Заказ, Заказ.ВидВырубки);
	Если текДлинаПечати <> Заказ.ДлинаПечати Тогда
		Заказ.ДлинаПечати 				= текДлинаПечати;
		текБылиИзменения = Истина;
	КонецЕсли;
	
	Возврат текБылиИзменения;
	// <-- Конец Лико Митюшин МФМ 19.05.2021
КонецФункции

Функция ПолучитьПлощадьКлише(Заказ, ВидВырубки = 0, СпецификацияСсылка = Неопределено) Экспорт
	
	//Заказ.Z.КоличествоЗубьев
	Если ВидВырубки = 0 Тогда
		Если ЗначениеЗаполнено(Заказ.Z) Тогда
			Возврат ((Заказ.Z.КоличествоЗубьев*3.175*0.1) + 2)*(Заказ.Нарезка.Размер/10 + 2);
		Иначе
			Возврат (Заказ.ШагПечати*100+ 2)*(Заказ.Нарезка.Размер/10 + 2); 	
		КонецЕсли;
	ИначеЕсли ВидВырубки = 2 ИЛИ ВидВырубки = 8 ИЛИ ВидВырубки = 15 Тогда
		Возврат (Заказ.ШагПечати*100 + 2)*(Заказ.Нарезка.Размер/10 + 2);
	Иначе 	
		Возврат (Заказ.ДлинаПечати*100 + 2)*(Заказ.Нарезка.Размер/10 + 2);	
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
	
#КонецОбласти

//Определение Тиража и Метража Индиго
#Область ТиражМетражИндиго
Функция ПолучитьДлинуПечатиИндиго(Заказ, текВидВырубки, СпецификацияСсылка = Неопределено) Экспорт
	
	//Если текВидВырубки = 2 ИЛИ ТекВидВырубки = 6 Тогда
	//	Если ДлинаСПрипуском = Неопределено И КоличествоПоДлинеРапорта = Неопределено Тогда 
	//		Если текВидВырубки = 2 Тогда
	//			Если (Заказ.ШагПечати = 0 ИЛИ Заказ.ЭтикетокНаЛисте = 0 ИЛИ Заказ.Ручьи = 0) Тогда 
	//				ДлинаСПрипуском = 0 
	//			Иначе 
	//				ДлинаСПрипуском = Заказ.ШагПечати/(Заказ.ЭтикетокНаЛисте/Заказ.Ручьи);
	//			КонецЕсли;
	//		ИначеЕсли ТекВидВырубки = 6 Тогда
	//			ДлинаСПрипуском = ПолучитьДлиннуИлиШиринуЭтикетки(Заказ, СпецификацияСсылка) * 0.001;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если ДлинаСПрипуском <> 0 Тогда
	//		КоличествоПоДлинеРапорта = ?(КоличествоПоДлинеРапорта = Неопределено, Цел(0.98/ДлинаСПрипуском), КоличествоПоДлинеРапорта);
	//		Возврат КоличествоПоДлинеРапорта*ДлинаСПрипуском;
	//	Иначе
	//		Возврат 0;
	//	КонецЕсли;		
	//ИначеЕсли текВидВырубки = 4 Тогда
	//	Если ЭтоПечатьНаИндиго(Заказ, текВидВырубки) Тогда 
	//		текШагПечати = Заказ.ШагПечати;
	//		Возврат ?(текШагПечати <> 0, Цел(0.98/текШагПечати)*текШагПечати, 0);
	//	Иначе
	//		Возврат 0;	
	//	КонецЕсли;
	//ИначеЕсли ТекВидВырубки = 5 Тогда 
	//	Возврат 0; 			
	//КонецЕсли;
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда 
		Возврат Заказ.КоличествоЭтПоДлинеПечатиИндиго * Заказ.ЭтМЭР; 	
	ИначеЕсли текВидВырубки = 10 Тогда 
		Возврат Заказ.ШагПечати * Заказ.КоличествоШтамповПоДлинеПечатиИндиго;
	КонецЕсли;
	
КонецФункции

Функция ЭтоПечатьНаИндиго(Заказ, текВидПечать = 0) Экспорт
	
	текПараметрыОтбораПечать = Новый Структура;
	текПараметрыОтбораПечать.Вставить("ВидРабот",  Справочники.ВидыРаботСотрудников.Печать);
	//текПараметрыОтбораПечать.Вставить("НомерПроката", 1);
	текПараметрыОтбораПечать.Вставить("НомерВарианта", 1);

	текНайденныеСтрокиПечать = Заказ.ВидыРабот.НайтиСтроки(текПараметрыОтбораПечать);
	Если текНайденныеСтрокиПечать.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	ВидРЦIndigo 	= Справочники.ВидыРабочихЦентров.Indigo;
	Для Каждого текСтрокаПечати из текНайденныеСтрокиПечать Цикл
		Если ВидРЦIndigo = текСтрокаПечати.РабочийЦентр.ВидРабочегоЦентра Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьЭтикетокНаЛистеИндиго(Заказ, текВидВырубки, СпецификацияСсылка = Неопределено) Экспорт
	
	// <-- Начало Лико Яцун С. В. 13.06.2023
	//Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда 
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда 
	// <-- Конец Лико Яцун С. В. 13.06.2023	
		Возврат Заказ.КоличествоЭтПоДлинеПечатиИндиго * Заказ.РучьиПечатиИндиго;
	ИначеЕсли текВидВырубки = 10 Тогда 
		Возврат ?(Заказ.Ручьи = 0, 0, Заказ.КоличествоШтамповПоДлинеПечатиИндиго * Заказ.ЭтикетокНаЛисте *  Заказ.РучьиПечатиИндиго / Заказ.Ручьи);	
	КонецЕсли;                                                                                                       

	Возврат 0;
КонецФункции

Функция ПолучитьЭтикетокПоДлинеПечатиИндиго(Заказ, текВидВырубки, СпецификацияСсылка = Неопределено) Экспорт
	
	Если текВидВырубки = 2 ИЛИ текВидВырубки = 6 ИЛИ текВидВырубки = 9 ИЛИ текВидВырубки = 12 Тогда 
		Если НЕ ЭтоТермоусадка(Заказ, СпецификацияСсылка) И текВидВырубки = 6 Тогда 
			текКоэфДеления = ?(ЭтоКомлект(Заказ, СпецификацияСсылка), 0.5, 1);
		Иначе
			текКоэфДеления = 1;
		КонецЕсли;
		Возврат ?(Заказ.ЭтМЭР = 0, 0, Цел(0.98 / Заказ.ЭтМЭР)*текКоэфДеления);			
	КонецЕсли;	
		
КонецФункции

Функция ПолучитьZ(Заказ, текВидВырубки, СпецификацияСсылка = Неопределено) Экспорт
	
	Если текВидВырубки = 4 ИЛИ текВидВырубки = 5 ИЛИ текВидВырубки = 11 ИЛИ текВидВырубки = 12 Тогда 
		текЗ = Заказ.ДлинаПечати/3.175*1000;
		Разница = Цел(текЗ) - текЗ;
		Если Не (Макс(Разница, -Разница) > 0.001) Тогда
 			Возврат Справочники.Лико_ZКоличествоЗубьев.НайтиПоРеквизиту("КоличествоЗубьев", Цел(текЗ));
		КонецЕсли;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти
